// Модуль 2. Занятие 3. Массивы

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 1 - Базовые операции с массивом

//     Создайте массив genres с элементами «Jazz» и «Blues».
//     Добавьте «Рок-н-ролл» в конец.
//     Выведите в консоль первый элемент массива.
//     Выведите в консоль последний элемент массива. Код должен работать для массива произвольной длины.
//     Удалите первый элемент и выведите его в консоль.
//     Вставьте «Country» и «Reggae» в начало массива.

// const genres = ['Jazz', 'Blues'];
// console.log(genres);

// genres.push('Rock-n-Roll');
// console.log(genres);

// console.log(genres[0]);

// console.log(genres[genres.length - 1]);

// console.log(genres.shift());

// genres.unshift('Country', 'Reggae');
// console.log(genres);

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 2 - Массивы и строки

// Напиши скрипт для вычисления площади прямоугольника со сторонами, значения которых
//  хранятся в переменной values в виде строки.Значения гарантированно разделены пробелом.

// const values = '7 11';
// // const newArr = values.split(' ');
// // console.log(newArr);
// // console.log(typeof newArr[0]);
// // console.log(typeof newArr[0] * typeof newArr[1]);
// const square = values.split(' ')[0] * values.split(' ')[1];
// console.log('Площа прямокутника: ' + square);
// // console.log(typeof square);

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 3 - Перебор массива

// Напиши скрипт для перебора массива fruits циклом for. Для каждого элемента массива выведи
// в консоль строку в формате номер_элемента: значение_элемента.Нумерация элементов должна начинаться с 1.

// const fruits = ['🍎', '🍇', '🍑', '🍌', '🍋'];
// for (let i = 1; i <= fruits.length; i++) {
//   console.log(`${i}: ${fruits[i - 1]}`);
// }

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 4 - Массивы и циклы

// Напиши скрипт который выводит в консоль имя и телефонный номер пользователя. В переменных
//  names и phones хранятся строки имен и телефонных номеров, разделенные запятыми.Порядковый
//  номер имен и телефонов в строках указывают на соответствие.Количество имен и телефонов
//  гарантированно одинаковое.

// const names = 'Jacob,William,Solomon,Artemis';
// const phones = '89001234567,89001112233,890055566377,890055566300';
// for (let i = 0; i < names.split(',').length; i++) {
//   console.log(`Name: ${names.split(',')[i]} - ${phones.split(',')[i]}.`);
// }

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 5 - Массивы и строки

// Напиши скрипт который выводит в консоль все слова строки кроме первого и последнего.
// Результирующая строка не должна начинаться или заканчиваться пробельным символом.
// Скрипт должен работать для любой строки.

// const string = 'think I can fly welcome to the future or past';
// let result = string
//   .split(' ')
//   .slice(1, string.split(' ').length - 1)
//   .join(' ');
// result = result[0].toUpperCase() + result.slice(1);
// console.log(result);

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 6 - Массивы и строки

// Напиши скрипт который «разворачивает» строку (обратный порядок букв) и выводит ее в консоль.

// const string = 'Welcome to the future';
// const result = string.split('').reverse().join('');
// console.log(string);
// console.log(result);

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 7 - Сортировка массива с циклом

// Напиши скрипт сортировки массива строк в алфавитном порядке по первой букве элемента.

// v - 1:_____
// const langs = ['python', 'javascript', 'c++', 'haskel', 'php', 'ruby', 'c#', 'asic', 'f#'];
// const result = langs.sort().join(' ');
// console.log(result);

// // // v - 2:_____
// const langs = ['python', 'javascript', 'c2++', 'haskel', 'php', 'ruby', 'c1#', 'asic', 'f#', 'A3', 'A2', 'A1'];
// // const langs = ['python', 'c2++', 'php', 'c1#'];
// console.table(langs);
// for (let i = 0; i < langs.length - 1; i++) {
//   for (let j = i + 1; j < langs.length; j++) {
//     const word1 = langs[i];
//     const word2 = langs[j];
//     if (word1[0] > word2[0]) {
//       langs[i] = word2;
//       langs[j] = word1;
//     }
//     // console.log(`${word1} and ${word2}`);
//   }
// }

// console.log(langs);

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Example 8 - Поиск элемента

// Напиши скрипт поиска самого маленького числа в массиве.
// Код должен работать для любого массива чисел.Используй цикл для решения задачи.

// const numbers = [12, 17, 94, 7, 23, 37, 99, 5, 1];
// let min = numbers[0];
// for (let i = 1; i < numbers.length; i++) {
//   if (numbers[i] < min) min = numbers[i];
// }
// console.log(min); // 1

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// // Метод .map

// const numbers2 = [12, 17, 94, 7, 23, 37, 99, 5, 1];
// console.log(numbers2);
// numbers2.map(function (value, index, arrey) {
//   return console.log(index * value);
// });

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// // Деструктуризация массивов
// const profile = ['Oluwatobi', 'Sofela', 'codesweetly.com'];
// const [firstName, ...otherInfo] = profile;

// console.log(`firstName: ${firstName}`); // "Oluwatobi"
// console.log('otherInfo: ');
// console.log(otherInfo); // ["Sofela", "codesweetly.com"]
// console.log(profile);

// console.log(langs);

// ----------------------------------------- QUICK SORT --------------------------------------------

// function quicksort(arr) {
//   if (arr.length < 2) return arr;

//   const pivot = arr[0];
//   const left = [];
//   const right = [];

//   for (let i = 1; i < arr.length; i += 1) {
//     arr[i] < pivot ? left.push(arr[i]) : right.push(arr[i]);
//   }

//   return quicksort(left).concat(pivot, quicksort(right));
// }

// console.log(quicksort([2, 5, 3, 0, 6, 1, 4]));

// --------------------------------------------------------------------------------------------------------------------------------------
// --------------------------------------------------------------------------------------------------------------------------------------
// Задача Автоперевірки 9/32
//Напиши функцію getExtremeElements(array), яка приймає один параметр array - масив елементів довільної довжини.
// Функція повинна повертати масив з двох елементів - першого і останнього елемента параметра array.

// v - 1: Method .splise()
// function getExtremeElements(array) {
//   array.splice(1, array.length - 2);
//   return array;
// }
// console.log(getExtremeElements([1, 2, 3, 4, 5]));

// v - 2: Methods .slise() & .concat()
// function getExtremeElements(array) {
//   return array.slice(0, 1).concat(array.slice(-1));
// }
// console.log(getExtremeElements([1, 2, 3, 4, 5]));

// v - 3:  Methods .shift() and .pop()
// function getExtremeElements(array) {
//   return [array.shift(), array.pop()];
// }
// console.log(getExtremeElements([1, 2, 3, 4, 5]));

// v - 4: just new array
// function getExtremeElements(array) {
//   let result = [array[0], array[array.length - 1]];
//   return result;
// }
// console.log(getExtremeElements([1, 2, 3, 4, 5]));

// // v - 4-2:
// function getExtremeElements(array) {
//   return [array[0], array[array.length - 1]];
// }
// console.log(getExtremeElements([1, 2, 3, 4, 5]));

// Задача Автоперевірки 12/32
// Напиши функцію slugify(title), яка приймає заголовок статті, параметр title, і повертає slug, створений з цього рядка.
//     Значенням параметра title будуть рядки, слова яких розділені лише пробілами
//     Усі символи slug повинні бути у нижньому регістрі
//     Всі слова slug повинні бути розділені тире

// const slugify = title => title.toLowerCase().split(' ').join('-');
// console.log(slugify('Welcom to Alabama'));
